app/views/snapshot/show.html.erb

        <tr>
            <td><%=ProcessApp.find(snapshot.process_app_id).name%></td>
---
SELECT "process_apps".* FROM "process_apps" WHERE "process_apps"."id" = ? LIMIT 1  [["id", "28"]]