app/controllers/process_app_controller.rb

  def index
    @process_apps = ProcessApp.all
---
SELECT "process_apps".* FROM "process_apps"

  def show
    @process_app = ProcessApp.find(params[:id])
---
SELECT "process_apps".* FROM "process_apps" WHERE "process_apps"."id" = ? LIMIT 1  [["id", "3"]]