app/controllers/snapshot_controller.rb

  def show
    @processApp = ProcessApp.find(params[:pid])
    @snapshot = Snapshot.find(params[:sid])

    @foo = []
    @snapshot.findDependencies(params[:sid], @foo)
---
SELECT "process_apps".* FROM "process_apps" WHERE "process_apps"."id" = ? LIMIT 1  [["id", "28"]]
SELECT "snapshots".* FROM "snapshots" WHERE "snapshots"."id" = ? LIMIT 1  [["id", "146"]]
SELECT "dependencies".* FROM "dependencies" WHERE "dependencies"."id" = ? LIMIT 1  [["id", "146"]]