app/views/process_app/show.html.erb

    </tr>
    <% @process_app.snapshots.each do |snapshot| %>
---
SELECT "snapshots".* FROM "snapshots" WHERE "snapshots"."process_app_id" = 3